{
  "URL": "https://digital.ai/",
  "COMPANY_NAME": "Digital.ai",
  "PRODUCTS": [
    "TeamForge"
  ],
  "DOCS_URL": "https://docs.digital.ai/",
  "CURRENT_YEAR": 2024,
  "FEEDBACK_EMAIL": "docfeedback@digital.ai",
  "identifiers": {
    "teamforge": "23.1",
    "teamforge_previous": "23.0",
    "teamforge_second_previous": "22.1",
    "teamforge_onehop_compatible_version": "22.0",
    "teamforge_onehop_incompatible_version": "21.2",
    "teamforge_noarch_repo_name": "collabnet-teamforge-repo-23.1-0-noarch.rpm",
    "teamforge_rhel_centos_now_64_bit_dm_repo_name": "CTF-Disconnected-media-23.1.355-462.rhel8.x86_64.rpm",
    "teamforge_rhel_centos_past_64_bit_dm_repo_name": "CTF-Disconnected-media-23.1.355-462.rhel7.x86_64.rpm",
    "centos_compat_rpm": "compat-ctf-dc-media-1.2-1.el7.noarch.rpm",
    "rhel_centos_past": "RHEL/CentOS 7.9",
    "rhel_centos_now": "RHEL 8.8",
    "google_chrome": "99",
    "mozilla_firefox": "98",
    "microsoft_ie": "11",
    "msedge": "100",
    "review_board_os76": "4.0.6",
    "review_board_os610": "4.0.6",
    "git_gerrit": "3.5.6",
    "openjdk": "11.0.17",
    "apache_httpd_server_past": "2.4.6",
    "apache_httpd_server_now": "2.4.37",
    "subversion_rhel7": "1.10.2",
    "subversion_rhel8": "1.10.6",
    "subversion_edge": "5.0",
    "postgres_short": "13.11",
    "postgres_long": "13.11",
    "postgres_past_short": "11.12",
    "postgres_past_long": "11.12",
    "postgres_second_past_short": "11.6",
    "postgres_second_past_long": "11.6",
    "elasticsearch": "7.16.3",
    "tomcat": "9.0.73",
    "phantomjs": "2.1.1",
    "james": "2.3.2.1",
    "lucene": "5.5.5",
    "postgres_JDBC_driver": "42.4.3",
    "highcharts": "7.1.1",
    "jboss_wildfly": "22.0",
    "oracle_JDBC_driver": "12.1.0.2",
    "oracle_server": "19c",
    "oracle_client": "19c",
    "yum_package_manager": "3.2.29 (or earlier versions)",
    "cvs": "1.11.x",
    "viewvc": "1.1.24",
    "nexus3": "3.61.0",
    "nexus3-plugin-version": "3.3.79",
    "artifactory": "4.7",
    "jira": "9.0.0–9.11.0",
    "testlink": "1.9.17–1.9.20",
    "crucible": "3.0.1",
    "jenkins": "2.332",
    "jenkins_integration_plugin": "2.0.10",
    "nginx": "1.5.1",
    "phusion_passenger": "4.0.5",
    "redis": "2.6.13",
    "mongodb": "2.6",
    "rabbitmq": "3.6.2"
  },
  "glossary": {
    "active_passive_cluster": "Active/passive — Consists of a cluster of fully redundant servers, of which only one remains active at any point in time. Other servers remain passive. Failover happens when the active server fails.",
    "active_active_cluster": "Active/active — Traffic is passed on to any of the intended for the failed node is either passed onto an existing node or load balanced across the remaining nodes. This is usually only possible when the nodes use a homogeneous software configuration.",
    "baseline": "An approved snapshot of selected configuration items from a TeamForge project at a given point in time. For example, create a Baseline when you release or deliver a product or when you accomplish specific milestones in your project. Baselines can be created from the ground up or from existing Baseline Definitions",
    "configuration_item": "A project component that can be uniquely identified. Typically, a Baseline in TeamForge can include the following configuration items such as Tracker Artifacts, Documents, Source Code Repositories (only Git and Subversion are supported), File Releases, and Binaries (only Nexus binaries are supported).",
    "baseline_definition": "The filter criteria that is used to create a baseline of a set of selected configuration items such as Tracker Artifacts, Documents, Source Code Repositories (only Git and Subversion are supported), File Releases, and Binaries (only Nexus binaries are supported) in a TeamForge project. A Baseline Definition can include other Baseline Definitions from within the same project, in which case the Baseline Definition would be derived as a union of the native filter conditions as defined in the Baseline Definition and the filter conditions of the selected Baseline Definitions.",
    "project_baseline_definition": "The filter criteria that is used to create a baseline of a set of selected configuration items at the project level. Such a Project Baseline Definition can include one or more Baseline Definitions too, in which case the Project Baseline Definition would be derived as a union of the native filter conditions as defined in the Project Baseline Definition and the filter conditions of the selected Baseline Definitions. A TeamForge project can have only one Project Baseline Definition and can be modified whenever required.",
    "project_baseline": "A Project Baseline is a baseline created on a project at a given point in time. Project Baselines are typically created using Project Baseline Definitions. Once you have Project Baselines created, you can restart previously baselined TeamForge projects from Project Baselines and continue from the exact point when the project was last baselined.",
    "external_baselines": "Any approved Baseline or Project Baseline from other TeamForge projects included within a given Baseline or Project Baseline.",
    "baseline_package": "A downloadable package of physical project artifacts such as Tracker Artifacts, Documents, Source Code Repositories (only Git and Subversion are supported), File Releases, and Binaries (only Nexus binaries are supported) generated from an approved Baseline or a Project Baseline. Once generated, you can download and share the package with your stakeholders."
  },
  "config": {
    "feedback_subject_line": "TeamForge 22.1 Documentation Feedback",
    "description": "Digital.ai Help Center, the only source of comprehensive documentation for all the Digital.ai products."
  }
}